import React from "react"

export const PrintComp = React.forwardRef((props, ref) => {
    return (
    <div ref={ref}>
     <table border="1" cellSpacing="0" cellPadding="0" width='600px'>
    <thead>
        <tr>
            <th colSpan="10">а</th>
        </tr>
    </thead>
        <tbody>
        <tr>
            <td colSpan="6">Сервисный центр XF10.BY</td>
            <td colSpan="2" rowSpan="2" align="center">29 6079850в</td>
            <td colSpan="2" rowSpan="14" transform={'rotate(180deg)'}>МБА_7405</td>
        </tr>
        <tr>
            <td colSpan='6'>Максимус, Минск,  Лобанка 94, пав 10</td>
        </tr>
        <tr>
            <td colSpan="2">Квитанция №</td>
            <td>МБА_7405</td>
            <td colSpan='2'>3/27/24 10:54</td>
            <td>Приемщик:</td>
            <td colSpan='2'>Бородач ДА</td>
        </tr>
        <tr>
            <td colSpan="2">Заказчик:</td>
            <td colSpan="6">Имя ФИО Сухаревская 46 87</td>
        </tr>
        
        <tr>
            <td colSpan="2">Устройство</td>
            <td colSpan="2">Мобильный телефон</td>
            <td colSpan="4">Mi rn4</td>
        </tr>
        <tr>
            <td colSpan="2">Серийный номер</td>
            <td colSpan="6">бн</td>
        </tr>
        <tr>
            <td colSpan="2">Внешний вид</td>
            <td colSpan="6">бу, потерт</td>
        </tr>
        <tr>
            <td colSpan="2">Комплектация</td>
            <td colSpan="6">батарея, крышка</td>
        </tr>
        <tr>
            <td colSpan="2">Предварительная согласованая стоимость:</td>
            <td colSpan="6">45р</td>
        </tr>
        <tr>
            <td colSpan="2">Неисправность со слов заказчика</td>
            <td colSpan="6">разъем наушников</td>
        </tr>
        <tr>
            <td colSpan="7">Стоимость и срок ремонта согласуется с заказчиком в течении 10 рабочих дней. </td>
            <td>М.П.</td>
        </tr>
        <tr>
            <td colSpan={2}>Телефоны для справок:</td>
            <td colSpan={6}>(29) 1344448 vel, (29) 7716827 мтс</td>
        </tr>
        <tr>
            <td colSpan="8" align="center">Правила и условия ремонта и диагностики.</td>
        </tr>
        <tr>
            <td colSpan="8">
            <font size="1">
            <p>1.Срок диагностики и ремонта до 15 рабочих дней, за исключением п.2 и п.3. В момент сдачи оборудования в ремонт приемщик оговаривает ОРИЕНТИРОВОЧНЫЕ СРОКИ, которые могут изменитьтся ввиду отсутствия или пересортицы з.ч, загруженности мастера и иных обстоятельств.</p> 
            <p>2.При отсутствии деталей диагностика и ремонт продлевается на срок до их получения.</p>
            <p>3.При периодически появляющейся неисправности ремонт может продлеваться на неопределенный срок, до полного устранения дефектов.</p>
            <p>4.В случае отказа заказчика от дальнейшей диагностики и(или) ремонта оборудование выдается в течении 7 рабочих дней с момента требования, после оплаты заказчиком понесенных расходов мастерской, связаных с ремонтом  и(или) хранением оборудования.</p>
            <p>5.В случае если мастер не связался с вами раньше, самостоятельно получить информацию о состоянии оборудования возможно по истечении 10 рабочих дней по телефонам, указаным в квитанции выше.</p>
            <p>6.После диагностики и(или) ремонта могут оставаться следы вскрытия и внешнего воздействия.</p>
            <p>7.Ремонт производится только в отношении неисправностей, которые указаны клиентом при приёмке, за исключением п.8.</p>
            <p>8.Если в результате ремонта возникли неисправности, заведомо не оговоренные, но препятствующие исправлению первоначальных неисправностей или препятствующие полноценной работе оборудования, то данные работы проводятся после устного согласования с Заказчиком. Заказчик и Исполнитель обязуются считать такие согласования имеющими силу.</p>
            <p>9.При диагностике и (или) ремонте оборудования в некоторых случаях невозможно вернуть состояние оборудования на момент сдачи в ремонт.</p>
            <p>10.Оборудование, с согласия клиента принято без разборки и проверки внутренних неисправностей и повреждений. Заказчик согласен, что все обнаруженные в процессе диагностики и ремонта неисправности возникли до сдачи оборудования в ремонт.</p>
            <p>11.Сервисный центр не несет ответственности за любую информацию (а так же карты памяти и sim карты, оставленные в оборудовании), хранящуюся на оборудовании.</p>
            <p>12.При обнаружении в оборудовании следов воздействия влаги, а также при сильных механических повреждениях, гарантия на произведенный ремонт НЕ РАСПРОСТРАНЯЕТСЯ (п.11.4, СТБ 1303-2007). Гарантия не распространяется на ремонты, связанные с установкой и настройкой программного обеспечения!!!</p>
            <p>13.Клиент принимает на себя риск возможной полной или частичной утраты работоспособности оборудования в процессе диагностики и (или) ремонта в случае грубых нарушений пользователем условий эксплуатации, наличия следов коррозии, попадания жидкости, либо механических воздействий.</p>
            <p>14.Спустя 30 дней от даты составления данной квитанции наступает ответственное хранение техники (отремонтированой либо нет) стоимостью 5 б.р. в сутки. По истечению 60 дней от даты составления данной квитанции, клиент отказывается от прав собственности на отремонтированое либо неотремонтированное оборудование и техника утилизируется любым доступным способом. Связаные с этим убытки заказчика возмещению не подлежат. Квитанция может быть продлена Заказчиком лично только на технику ожидающую зч либо на неотремонтированую, продление срока на готовую технику не производится.</p>
            <p>15.Первичная диагностика производится БЕСПЛАТНО. Стоимость акта диагностики, если таковой необходим заказчику, 70 б.р..</p>
            </font>
            </td>
        </tr>
        <tr>
            <td colSpan="10">t</td>
        </tr>
        <tr>
            <td>Клиент</td>
            <td>_________________</td>
            <td>АПВАПВ</td>
            <td></td>
            <td>Приемщик</td>
            <td>__________</td>
            <td>Бородач ДА</td>
            <td></td>
            <td colSpan="2" rowSpan={2}></td>
        </tr>
        <tr>
            <td></td>
            <td>подпись</td>
            <td></td>
            <td></td>
            <td></td>
            <td>подпись</td>
            <td></td>
            <td></td>
        </tr>
        <tr>
            <td colSpan="10">---------------------------------------------------------------------------------------------------------------------------------</td>
        </tr>
        <tr>
            <td colSpan="8">Сервисный центр F10.BY</td>
            <td colSpan="2" rowSpan={6}>29 6079850в</td>
        </tr>
        <tr>
            <td colSpan="8">Максимус, Минск,  Лобанка 94, пав 10</td>
        </tr>
        <tr>
            <td colSpan="4" align="center">Акт выполненых работ \ Гарантийный талон №</td>
            <td align="center">МБА_7405</td>
            <td  colSpan="3" align="center">от________г.</td>
        </tr>
        <tr>
            <td>Устройство:</td>
            <td colSpan={2}>Мобильный телефон</td>
            <td colSpan={4}>Mi rn4</td>
            <td>М.П.</td>
        </tr>
        <tr>
            <td colSpan={2}>Серийный номер\IMEI:</td>
            <td colSpan={5}>бн</td>
            <td></td>
        </tr>
        <tr>
            <td colSpan={8}>Услуга:</td>
        </tr>
        <tr>
            <td colSpan={8}>Срок гарантии (дней):</td>
            <td colSpan={2} rowSpan={5}>МБА_7405</td>
        </tr>
        <tr>
            <td colSpan={8}>Стоимость:</td>
        </tr>
        <tr>
            <td>Заказчик:</td>
            <td colSpan={7}>ФИО Сухаревская 46 87  29 6079850в</td>
        </tr>
        <tr>
            <td colSpan="8">
            <font size="1">
              Гарантийные обязательства по бесплатному ремонту не распространяется на следующие случаи:
              <p>- Механические повреждения, попадания внутрь жидкости и других посторонних предметов (насекомые и т.п.)</p>
              <p>- Нарушены правила эксплуатации, хранения или транспортировки товара в случае действий покупателя, третьих лиц или обстоятельств непреодолимой силы (пожар, наводнение и т. п.)</p>
              <p>- Отсутствует или испорчен гарантийный талон (гарантийный талон не восстанавливается, ксерокопии или другие копии действительными не считаются).</p> 
              <p>- Нарушение маркировки или невозможность считывания серийного номера с изделия, нарушены пломбы, наклейки, стикеры, обнаружены следы их переклеивания, восстановления и т. п.</p>
              <p>- Повреждения, вызванные стихийными бедствиями, пожаром, неблагоприятными бытовыми факторами (например, повышенной влажностью помещения, где использовалось изделие)</p>
              <p>- Есть следы механических, химических, электротехнических повреждений, как самого товара, так и его компонентов, а также в случае присутствия следов перегрева или переохлаждения либо воздействия пыли или насекомых.</p>
              <p>- Нарушена или испорчена комплектность товара.</p>
              <p>- Есть следы использования изделия в режимах с нагрузкой, превышающей нормативную.</p> 
              <p>- Присутствует вмешательство в техническую начинку товара, следы самостоятельного ремонта. Ремонт в неуполномоченном сервисном центре, либо произведенный лицами, не имеющими полномочий производить ремонт.</p>
              </font>
              </td>
       </tr>
        <tr>
            <td>Мастер:</td>
            <td colSpan={2}>Сотрудник СЦ:</td>
            <td colSpan={5}>Заказчик:</td>
        </tr>
        <tr>
            <td colSpan={10}>---------------------------------------------------------------------------------------------------------------------------------</td>
        </tr>
        <tr>
            <td colSpan={8}>Бородач ДА</td>
            <td rowSpan={8}>Mi rn4</td>
            <td rowSpan={8}>3/27/2024</td>
        </tr>
        <tr>
            <td colSpan={2}>29 6079850в</td>
            <td colSpan={2}>МБА_7405</td>
            <td colSpan={2}>3/27/24 10:54</td>
            <td>цена</td>
            <td></td>
        </tr>
        <tr>
            <td></td>
            <td></td>
            <td colSpan={4}  rowSpan={2}></td>
            <td>согл</td>
            <td></td>
        </tr>
        <tr>
            <td>Заказчик:</td>
            <td></td>
            <td>готов</td>
            <td></td>
        </tr>
        <tr>
            <td colSpan={2}>сог. цена</td>
            <td colSpan={4}>45р</td>
            <td>увед</td>
            <td></td>
        </tr>
        <tr>
            <td colSpan={6}>бу, потерт</td>
            <td>гарант</td>
            <td></td>
        </tr>
        <tr>
            <td colSpan={5}>разъем наушников</td>
            <td colSpan={3}>батарея, крышка</td>
        </tr>
        <tr>
            <td colSpan={2}>Обычный</td>
            <td colSpan={6}>МБА_7405 МБА_7405 МБА_7405</td>
        </tr>
    </tbody>
</table>
  </div>
    )
})